"""3) Написать скрипт, который переконвертирует строку в целочисленное
Пример:
["12", "15", "16", "17"] до
[12, 15, 16, 17] после
Требование:
Использовать list comprehension"""

string = ['1', '2', '3', '4', '5', '6', '7', '8', '9']
string2 = [int(x) for x in string]
print(string2)